trade_exp/src/InformationRegisters/Патерностеры/Патерностеры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="3347a283-ea6c-4862-9497-8f2154904bdb">
  <name>Патерностеры</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="28af626b-96d5-4031-ad57-dc748544f750">
    <name>Патерностер</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="35574121-fd65-43c5-9c07-79d36fc4fc55">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="3c7bf49b-4de8-4064-b841-59c59fda6fb4">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="61b23e85-c677-44d9-a19b-6969f6adc4da">
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/Catalogs/Патерностеры/Патерностеры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="05a938bc-6220-416c-8cde-f88c973cbdee">
  <name>Патерностеры</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="8272bb98-1e99-4b2c-b747-761a7622b5c2">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="da69e660-7b40-4918-97b0-ba2cd02dbd0a">
    <name>Патерностер</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="7078ea20-4b68-48d9-90af-59e07c81572a">
    <name>Вал</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="9dc125bc-2526-44d6-a2cb-40cacc6efd19">
    <name>ДопустимаяНагрузкаНаСтанок</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="1d1a5bd6-9694-4ab3-9043-7bbe8fea00e1">
    <name>ДопустимаяНагрузкаНаВал</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="98c55f36-f1c1-45c3-95c9-c938e3aa5773">
    <name>ДисбалансПоСторонам</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
</mdclass:Catalog>

trade_exp/src/InformationRegisters/Патерностеры/ManagerModule.bsl
Процедура ЗаписатьПатерностер(Склад, Номенклатура, Характеристика, Патерностер, Период) Экспорт 
	ЗанятостьПатерностера = ПроверитьЗанятостьПатерностера(Склад, Номенклатура, Характеристика, Патерностер, Период);  
	Если ЗанятостьПатерностера.Свойство("Занятость") Тогда
		Если  ЗанятостьПатерностера.Занятость <> 0 Тогда 
			//Очистить занятый патерностер
			НаборЗаписей = РегистрыСведений.Патерностеры.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Склад.Установить(ЗанятостьПатерностера.Склад);
			//НаборЗаписей.Отбор.Номенклатура.Установить(ЗанятостьПатерностера.Номенклатура); 
			//НаборЗаписей.Отбор.Характеристика.Установить(ЗанятостьПатерностера.Характеристика);
			НаборЗаписей.Прочитать();
			Для каждого НоваяЗапись Из НаборЗаписей Цикл
				Если НоваяЗапись.Патерностер = ЗанятостьПатерностера.Патерностер Тогда
					НоваяЗапись.Патерностер = Неопределено;
					НаборЗаписей.Записать(Истина);  
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;	
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.Патерностеры.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Склад.Установить(Склад);
	НаборЗаписей.Отбор.Номенклатура.Установить(Номенклатура); 
	НаборЗаписей.Отбор.Характеристика.Установить(Характеристика);
	НаборЗаписей.Прочитать();
	Если НаборЗаписей.Количество() = 0 Тогда
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Склад = Склад;
		НоваяЗапись.Номенклатура = Номенклатура;
		НоваяЗапись.Характеристика = Характеристика;
		НоваяЗапись.Патерностер = Патерностер;
	Иначе
		НоваяЗапись = НаборЗаписей[0];
		НоваяЗапись.Патерностер = Патерностер;
	КонецЕсли;
	НаборЗаписей.Записать(Истина);  
КонецПроцедуры	 

// Результат 0 - не занят, 1 - занят, 2 - занят с нулевым остатком 
Функция ПроверитьЗанятостьПатерностера(Склад, Номенклатура, Характеристика, Патерностер, Период) Экспорт   
	Результат = Новый Структура;
	СвободныеВалы = Новый Массив;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Патерностеры.Характеристика КАК Характеристика,
	|	Патерностеры.Патерностер КАК Патерностер,
	|	Патерностеры.Номенклатура КАК Номенклатура,
	|	ТоварыНаСкладахОстатки.ВНаличииОстаток КАК Остаток,
	|	Патерностеры.Склад КАК Склад
	|ПОМЕСТИТЬ ВТ_Занятые
	|ИЗ
	|	РегистрСведений.Патерностеры КАК Патерностеры
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(&Период,) КАК ТоварыНаСкладахОстатки
	|		ПО (Патерностеры.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура)
	|		И (ТоварыНаСкладахОстатки.Характеристика = Патерностеры.Характеристика)
	|		И (Патерностеры.Склад = ТоварыНаСкладахОстатки.Склад)
	|ГДЕ
	|	Патерностеры.Патерностер.Склад = &Склад
	|	И Патерностеры.Патерностер.Патерностер = &Патерностер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(ВТ_Занятые.Патерностер) КАК КоличествоЗаписейНаВалу,
	|	ВТ_Занятые.Склад КАК Склад,
	|	ВТ_Занятые.Патерностер КАК Патерностер,
	|	ВТ_Занятые.Патерностер.Вал КАК Вал,
	|	СУММА(ВТ_Занятые.Остаток) КАК Остаток
	|ПОМЕСТИТЬ ВТ_ЗанятыеВалы
	|ИЗ
	|	ВТ_Занятые КАК ВТ_Занятые
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Занятые.Склад,
	|	ВТ_Занятые.Патерностер,
	|	ВТ_Занятые.Патерностер.Вал
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Патерностеры.Ссылка КАК Ссылка,
	|	ВЫБОР
	|		КОГДА ВТ_Занятые.Патерностер ЕСТЬ NULL
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|			КОГДА ВТ_ЗанятыеВалы.Остаток > 0
	|				ТОГДА 1
	|			ИНАЧЕ 2
	|		КОНЕЦ
	|	КОНЕЦ КАК Занятость,
	|	ВТ_Занятые.Номенклатура КАК Номенклатура,
	|	ВТ_Занятые.Характеристика КАК Характеристика,
	|	Патерностеры.Склад КАК Склад,
	|	Патерностеры.Вал КАК Вал
	|ИЗ
	|	Справочник.Патерностеры КАК Патерностеры
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Занятые КАК ВТ_Занятые
	|		ПО (ВТ_Занятые.Патерностер = Патерностеры.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗанятыеВалы КАК ВТ_ЗанятыеВалы
	|		ПО (ВТ_ЗанятыеВалы.Патерностер = Патерностеры.Ссылка)
	|ГДЕ
	|	Патерностеры.Склад = &Склад
	|	И Патерностеры.Патерностер = &Патерностер
	|СГРУППИРОВАТЬ ПО
	|	Патерностеры.Ссылка,
	|	ВТ_Занятые.Номенклатура,
	|	ВТ_Занятые.Характеристика,
	|	Патерностеры.Склад,
	|	Патерностеры.Вал,
	|	ВЫБОР
	|		КОГДА ВТ_Занятые.Патерностер ЕСТЬ NULL
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|			КОГДА ВТ_ЗанятыеВалы.Остаток > 0
	|				ТОГДА 1
	|			ИНАЧЕ 2
	|		КОНЕЦ
	|	КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Патерностеры.Вал";        
	
	Запрос.Параметры.Вставить("Период",Период);
	Запрос.Параметры.Вставить("Склад",Склад);
	Запрос.Параметры.Вставить("Патерностер",Патерностер.Патерностер);
	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл  
		Если Выборка.Занятость <> 1 Тогда
			СвободныеВалы.Добавить(Выборка.Ссылка.Вал);
		КонецЕсли;	
		
		Если Выборка.Ссылка = Патерностер.Ссылка Тогда
			Результат.Вставить("Занятость",Выборка.Занятость); 
			Результат.Вставить("Склад",Выборка.Склад);
			Результат.Вставить("Номенклатура",Выборка.Номенклатура);
			Результат.Вставить("Характеристика",Выборка.Характеристика);  
			Результат.Вставить("Патерностер",Выборка.Ссылка);
		КонецЕсли;	
	КонецЦикла;  
	
	Если СвободныеВалы.Количество() > 0 Тогда
		Результат.Вставить("СвободныеВалы",СтрСоединить(СвободныеВалы,","));
	Иначе      
		Результат.Вставить("СвободныеВалы",СтрСоединить(СвободныеВалы,"Нет свободных"));
	КонецЕсли;	
	
	Возврат Результат;
	
КонецФункции
